dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
#include <stdio.h>
#include <ctype.h>
#include <string.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_spiffs.h"
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdspi_host.h"
#include "driver/spi_common.h"
#include "nvs_flash.h"
#include "bsp/esp-bsp.h"
#include "bsp/display.h"
#include "bsp_board_extra.h"
#include "audio_player.h"

#include "file_iterator.h"
#include "iot_button.h"
#include "button_gpio.h"
#include "wifi_manager.h"
#include "network_manager.h"
#include "bsp/esp32_p4_function_ev_board.h"  // For bsp_sdcard_mount/unmount
#include "local_music_player.h"
#include "ha_client.h"
#include "tts_player.h"
#include "audio_capture.h"
#include "wwd.h"
#include "mqtt_ha.h"
#include "ota_update.h"
#include "webserial.h"
#include "config.h"

#define TAG             "mp3_player"
#define BUTTON_IO_NUM   35
#define BUTTON_ACTIVE_LEVEL   0

static void conversation_response_handler(const char *response_text, const char *conversation_id)
{
    ESP_LOGI(TAG, "HA Response [%s]: %s",
             conversation_id ? conversation_id : "none",
             response_text);

    // Parse music control commands from HA response
    if (response_text && local_music_player_is_initialized()) {
        // Convert to lowercase for case-insensitive matching
        char *response_lower = strdup(response_text);
        if (response_lower) {
            for (char *p = response_lower; *p; p++) {
                *p = tolower((unsigned char)*p);
            }

            // Check for music control commands
            if (strstr(response_lower, "play music") || strstr(response_lower, "start music") ||
                strstr(response_lower, "play song")) {
                ESP_LOGI(TAG, "🎵 Voice command: Play music");
                local_music_player_play();
            }
            else if (strstr(response_lower, "stop music") || strstr(response_lower, "stop song")) {
                ESP_LOGI(TAG, "🎵 Voice command: Stop music");
                local_music_player_stop();
            }
            else if (strstr(response_lower, "pause music") || strstr(response_lower, "pause song")) {
                ESP_LOGI(TAG, "🎵 Voice command: Pause music");
                local_music_player_pause();
            }
            else if (strstr(response_lower, "resume music") || strstr(response_lower, "resume song") ||
                     strstr(response_lower, "continue music")) {
                ESP_LOGI(TAG, "🎵 Voice command: Resume music");
                local_music_player_resume();
            }
            else if (strstr(response_lower, "next song") || strstr(response_lower, "next track") ||
                     strstr(response_lower, "skip")) {
                ESP_LOGI(TAG, "🎵 Voice command: Next track");
                local_music_player_next();
            }
            else if (strstr(response_lower, "previous song") || strstr(response_lower, "previous track") ||
                     strstr(response_lower, "go back")) {
                ESP_LOGI(TAG, "🎵 Voice command: Previous track");
                local_music_player_previous();
            }

            free(response_lower);
        }
    }
}

static void network_event_callback(network_type_t type, bool connected)
{
    if (connected) {
        char ip_str[16];
        network_manager_get_ip(ip_str);

        ESP_LOGI(TAG, "========================================");
        ESP_LOGI(TAG, "Network Connected!");
        ESP_LOGI(TAG, "Type: %s", network_manager_type_to_string(type));
        ESP_LOGI(TAG, "IP Address: %s", ip_str);
        ESP_LOGI(TAG, "========================================");

        // Update MQTT sensor if MQTT is active
        if (mqtt_ha_is_connected()) {
            mqtt_ha_update_sensor("network_type", network_manager_type_to_string(type));
            mqtt_ha_update_sensor("ip_address", ip_str);
        }

        // Mount/unmount SD card based on network type
        if (type == NETWORK_TYPE_ETHERNET) {
            ESP_LOGI(TAG, "📀 Ethernet active - mounting SD card for local music...");
            esp_err_t sd_ret = bsp_sdcard_mount();
            if (sd_ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ SD card mounted successfully - local music playback enabled");

                // Initialize local music player
                esp_err_t music_ret = local_music_player_init();
                if (music_ret == ESP_OK) {
                    ESP_LOGI(TAG, "🎵 Local music player initialized - %d tracks found",
                             local_music_player_get_total_tracks());
                    if (mqtt_ha_is_connected()) {
                        mqtt_ha_update_sensor("sd_card_status", "ready");
                    }
                } else {
                    ESP_LOGW(TAG, "⚠️  Music player init failed - no music files found?");
                    if (mqtt_ha_is_connected()) {
                        mqtt_ha_update_sensor("sd_card_status", "no_music");
                    }
                }
            } else {
                ESP_LOGW(TAG, "⚠️  SD card mount failed - local music unavailable");
                if (mqtt_ha_is_connected()) {
                    mqtt_ha_update_sensor("sd_card_status", "failed");
                }
            }
        } else if (type == NETWORK_TYPE_WIFI) {
            ESP_LOGI(TAG, "📶 WiFi fallback active - SD card disabled");

            // Deinitialize music player if running
            if (local_music_player_is_initialized()) {
                ESP_LOGI(TAG, "Stopping local music player...");
                local_music_player_deinit();
            }

            // Unmount SD card if it was mounted
            if (bsp_sdcard != NULL) {
                ESP_LOGI(TAG, "Unmounting SD card (WiFi fallback mode)...");
                bsp_sdcard_unmount();
                if (mqtt_ha_is_connected()) {
                    mqtt_ha_update_sensor("sd_card_status", "unmounted");
                }
            }
        }
    } else {
        ESP_LOGW(TAG, "Network disconnected: %s", network_manager_type_to_string(type));

        // Deinitialize music player on network disconnect
        if (local_music_player_is_initialized()) {
            ESP_LOGI(TAG, "Stopping local music player...");
            local_music_player_deinit();
        }

        // Unmount SD card on network disconnect
        if (bsp_sdcard != NULL) {
            ESP_LOGI(TAG, "Unmounting SD card (network disconnected)...");
            bsp_sdcard_unmount();
            if (mqtt_ha_is_connected()) {
                mqtt_ha_update_sensor("sd_card_status", "disconnected");
            }
        }
    }
}

// Track if music was paused for TTS
static bool music_paused_for_tts = false;

static void tts_audio_handler(const uint8_t *audio_data, size_t length)
{
    ESP_LOGI(TAG, "Received TTS audio: %d bytes", length);

