dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
    // Pause music if playing (TTS takes priority)
    if (local_music_player_is_initialized() &&
        local_music_player_get_state() == MUSIC_STATE_PLAYING) {
        ESP_LOGI(TAG, "Pausing music for TTS playback");
        local_music_player_pause();
        music_paused_for_tts = true;
    }

    // Feed audio to TTS player
    esp_err_t ret = tts_player_feed(audio_data, length);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to feed TTS audio: %s", esp_err_to_name(ret));
    }
}

// Audio streaming test variables
static char *pipeline_handler = NULL;
static int audio_chunks_sent = 0;
static bool pipeline_active = false;
static int warmup_chunks_skip = 0;  // Skip first N chunks after wake word

// Dynamic configuration variables (adjustable via MQTT)
static uint32_t vad_threshold = 180;           // Speech energy threshold (50-300)
static uint32_t vad_silence_duration = 1800;   // Silence duration in ms (1000-3000)
static uint32_t vad_min_speech = 200;          // Min speech duration in ms (100-500)
static uint32_t vad_max_recording = 7000;      // Max recording duration in ms (5000-10000)
static float wwd_threshold = 0.5f;             // Wake word detection threshold (0.3-0.9)

// Forward declarations
static void test_audio_streaming(void);
static void wwd_audio_feed_wrapper(const int16_t *audio_data, size_t samples);
static void on_wake_word_detected(wwd_event_t event, void *user_data);

// MQTT entity callback handlers
static void mqtt_wwd_switch_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: WWD switch = %s", payload);

    if (strcmp(payload, "ON") == 0) {
        wwd_start();
        audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
        mqtt_ha_update_switch("wwd_enabled", true);
        ESP_LOGI(TAG, "Wake Word Detection enabled via MQTT");
    } else {
        wwd_stop();
        audio_capture_stop();
        mqtt_ha_update_switch("wwd_enabled", false);
        ESP_LOGI(TAG, "Wake Word Detection disabled via MQTT");
    }
}

static void mqtt_webserial_switch_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: WebSerial switch = %s", payload);

    if (strcmp(payload, "ON") == 0) {
        if (!webserial_is_running()) {
            esp_err_t ret = webserial_init();
            if (ret == ESP_OK) {
                mqtt_ha_update_switch("webserial_enabled", true);
                ESP_LOGI(TAG, "WebSerial enabled via MQTT");
            } else {
                ESP_LOGE(TAG, "Failed to start WebSerial");
                mqtt_ha_update_switch("webserial_enabled", false);
            }
        }
    } else {
        if (webserial_is_running()) {
            webserial_deinit();
            mqtt_ha_update_switch("webserial_enabled", false);
            ESP_LOGI(TAG, "WebSerial disabled via MQTT");
        }
    }
}

// MQTT Music Player Callbacks
static void mqtt_music_play_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Play music button pressed");
    if (local_music_player_is_initialized()) {
        local_music_player_play();
    } else {
        ESP_LOGW(TAG, "Music player not initialized (SD card not mounted?)");
    }
}

static void mqtt_music_stop_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Stop music button pressed");
    if (local_music_player_is_initialized()) {
        local_music_player_stop();
    }
}

static void mqtt_music_pause_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Pause music button pressed");
    if (local_music_player_is_initialized()) {
        local_music_player_pause();
    }
}

static void mqtt_music_resume_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Resume music button pressed");
    if (local_music_player_is_initialized()) {
        local_music_player_resume();
    }
}

static void mqtt_music_next_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Next track button pressed");
    if (local_music_player_is_initialized()) {
        local_music_player_next();
    }
}

static void mqtt_music_previous_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Previous track button pressed");
    if (local_music_player_is_initialized()) {
        local_music_player_previous();
    }
}

static void mqtt_restart_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Restart button pressed!");
    ESP_LOGI(TAG, "Restarting in 2 seconds...");
    vTaskDelay(pdMS_TO_TICKS(2000));
    esp_restart();
}

static void mqtt_test_tts_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Test TTS button pressed!");

    if (ha_client_is_connected()) {
        ESP_LOGI(TAG, "Requesting test TTS audio...");
        // Use a valid intent/question that HA will understand
        esp_err_t ret = ha_client_request_tts("Koliko je sati?");
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Test TTS request sent successfully");
        } else {
            ESP_LOGE(TAG, "Failed to send test TTS request");
        }
    } else {
        ESP_LOGW(TAG, "Cannot test TTS - not connected to Home Assistant");
    }
}

// OTA URL storage (set via MQTT sensor update)
static char ota_url_buffer[256] = "";

// MQTT OTA Trigger Callback (reads URL from ota_url_buffer)
static void mqtt_ota_trigger_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: OTA update button pressed");

    if (strlen(ota_url_buffer) == 0) {
        ESP_LOGE(TAG, "OTA update failed: No URL configured");
        ESP_LOGI(TAG, "Set OTA URL via: mosquitto_pub -h <broker> -t 'homeassistant/sensor/esp32p4_voice/ota_url/state' -m 'http://your-server/firmware.bin'");
        mqtt_ha_update_sensor("ota_status", "error: no URL");
        return;
    }

    if (ota_update_is_running()) {
        ESP_LOGW(TAG, "OTA update already in progress");
        mqtt_ha_update_sensor("ota_status", "already running");
        return;
    }

    ESP_LOGI(TAG, "Starting OTA update from: %s", ota_url_buffer);

    // Stop music if playing (OTA needs resources)
    if (local_music_player_is_initialized() &&
        local_music_player_get_state() == MUSIC_STATE_PLAYING) {
        ESP_LOGI(TAG, "Stopping music for OTA update");
        local_music_player_stop();
    }

