dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
    mqtt_ha_update_sensor("ota_status", "starting");

    esp_err_t ret = ota_update_start(ota_url_buffer);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start OTA update");
        mqtt_ha_update_sensor("ota_status", "failed to start");
    }
}

// OTA Progress Callback
static void ota_progress_callback(ota_state_t state, int progress, const char *message)
{
    ESP_LOGI(TAG, "OTA [%d%%]: %s", progress, message);

    // Update MQTT sensors
    char progress_str[8];
    snprintf(progress_str, sizeof(progress_str), "%d", progress);
    mqtt_ha_update_sensor("ota_progress", progress_str);

    switch (state) {
        case OTA_STATE_IDLE:
            mqtt_ha_update_sensor("ota_status", "idle");
            break;
        case OTA_STATE_DOWNLOADING:
            mqtt_ha_update_sensor("ota_status", "downloading");
            break;
        case OTA_STATE_VERIFYING:
            mqtt_ha_update_sensor("ota_status", "verifying");
            break;
        case OTA_STATE_SUCCESS:
            mqtt_ha_update_sensor("ota_status", "success");
            break;
        case OTA_STATE_FAILED:
            mqtt_ha_update_sensor("ota_status", "failed");
            break;
    }
}

static void mqtt_vad_threshold_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_threshold = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD threshold updated to %lu", vad_threshold);
    mqtt_ha_update_number("vad_threshold", (float)vad_threshold);
}

static void mqtt_vad_silence_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_silence_duration = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD silence duration updated to %lums", vad_silence_duration);
    mqtt_ha_update_number("vad_silence_duration", (float)vad_silence_duration);
}

static void mqtt_vad_min_speech_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_min_speech = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD min speech updated to %lums", vad_min_speech);
    mqtt_ha_update_number("vad_min_speech", (float)vad_min_speech);
}

static void mqtt_vad_max_recording_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_max_recording = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD max recording updated to %lums", vad_max_recording);
    mqtt_ha_update_number("vad_max_recording", (float)vad_max_recording);
}

static void mqtt_wwd_threshold_callback(const char *entity_id, const char *payload)
{
    wwd_threshold = atof(payload);
    ESP_LOGI(TAG, "MQTT: WWD threshold updated to %.2f", wwd_threshold);

    // Apply to WakeNet immediately if running
    if (wwd_is_running()) {
        wwd_stop();
        audio_capture_stop();
        vTaskDelay(pdMS_TO_TICKS(100));

        wwd_config_t wwd_config = wwd_get_default_config();
        wwd_config.callback = on_wake_word_detected;
        wwd_config.user_data = NULL;
        wwd_config.detection_threshold = wwd_threshold;

        esp_err_t ret = wwd_init(&wwd_config);
        if (ret == ESP_OK) {
            wwd_start();
            audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
            ESP_LOGI(TAG, "WWD restarted with new threshold");
        } else {
            ESP_LOGE(TAG, "Failed to restart WWD with new threshold");
        }
    }

    mqtt_ha_update_number("wwd_threshold", wwd_threshold);
}

// MQTT status update task
static void mqtt_status_update_task(void *arg)
{
    while (1) {
        if (mqtt_ha_is_connected()) {
            // Update WiFi RSSI
            // Note: Would need wifi_manager API to get RSSI
            mqtt_ha_update_sensor("wifi_rssi", "-45");

            // Update free memory
            char mem_str[32];
            uint32_t free_mem = esp_get_free_heap_size() / 1024; // KB
            snprintf(mem_str, sizeof(mem_str), "%lu", (unsigned long)free_mem);
            mqtt_ha_update_sensor("free_memory", mem_str);

            // Update uptime
            char uptime_str[32];
            uint32_t uptime_sec = esp_log_timestamp() / 1000;
            snprintf(uptime_str, sizeof(uptime_str), "%lu", (unsigned long)uptime_sec);
            mqtt_ha_update_sensor("uptime", uptime_str);

            // Update WWD state
            mqtt_ha_update_switch("wwd_enabled", wwd_is_running());

            // Update WebSerial status
            mqtt_ha_update_switch("webserial_enabled", webserial_is_running());
            char webserial_clients_str[8];
            snprintf(webserial_clients_str, sizeof(webserial_clients_str), "%d", webserial_get_client_count());
            mqtt_ha_update_sensor("webserial_clients", webserial_clients_str);

            // Update network status
            char ip_str[16];
            if (network_manager_get_ip(ip_str) == ESP_OK) {
                mqtt_ha_update_sensor("ip_address", ip_str);
            }
            mqtt_ha_update_sensor("network_type", network_manager_type_to_string(network_manager_get_active_type()));

            // Update SD card status
            if (bsp_sdcard != NULL) {
                mqtt_ha_update_sensor("sd_card_status", "mounted");
            } else {
                mqtt_ha_update_sensor("sd_card_status", "not_mounted");
            }

            // Update music player status
            if (local_music_player_is_initialized()) {
                // Update music state
                music_state_t state = local_music_player_get_state();
                const char *state_str;
                switch (state) {
                    case MUSIC_STATE_PLAYING:
                        state_str = "playing";
                        break;
                    case MUSIC_STATE_PAUSED:
                        state_str = "paused";
                        break;
                    case MUSIC_STATE_STOPPED:
                        state_str = "stopped";
                        break;
                    default:
                        state_str = "idle";
                        break;
                }
                mqtt_ha_update_sensor("music_state", state_str);

