dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
                // Update current track
                char track_name[64];
                if (local_music_player_get_track_name(track_name, sizeof(track_name)) == ESP_OK) {
                    mqtt_ha_update_sensor("current_track", track_name);
                } else {
                    mqtt_ha_update_sensor("current_track", "No track");
                }

                // Update total tracks
                char total_tracks_str[16];
                snprintf(total_tracks_str, sizeof(total_tracks_str), "%d",
                         local_music_player_get_total_tracks());
                mqtt_ha_update_sensor("total_tracks", total_tracks_str);
            } else {
                mqtt_ha_update_sensor("music_state", "unavailable");
                mqtt_ha_update_sensor("current_track", "N/A");
                mqtt_ha_update_sensor("total_tracks", "0");
            }

            // Update OTA status
            mqtt_ha_update_sensor("firmware_version", ota_update_get_current_version());
            if (strlen(ota_url_buffer) > 0) {
                mqtt_ha_update_sensor("ota_url", ota_url_buffer);
            } else {
                mqtt_ha_update_sensor("ota_url", "Not configured");
            }
            if (ota_update_is_running()) {
                // Status is updated by OTA progress callback
            } else {
                mqtt_ha_update_sensor("ota_status", "idle");
                mqtt_ha_update_sensor("ota_progress", "0");
            }

            // Update configuration numbers (only on first iteration or when changed)
            static bool config_published = false;
            if (!config_published) {
                mqtt_ha_update_number("vad_threshold", (float)vad_threshold);
                mqtt_ha_update_number("vad_silence_duration", (float)vad_silence_duration);
                mqtt_ha_update_number("vad_min_speech", (float)vad_min_speech);
                mqtt_ha_update_number("vad_max_recording", (float)vad_max_recording);
                mqtt_ha_update_number("wwd_threshold", wwd_threshold);
                config_published = true;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(10000)); // Update every 10 seconds
    }
}

// Wake word detection callback
static void on_wake_word_detected(wwd_event_t event, void *user_data)
{
    if (event == WWD_EVENT_DETECTED) {
        ESP_LOGI(TAG, "🎤 Wake word detected!");

        // Stop wake word detection
        wwd_stop();

        // Stop audio capture (from wake word mode)
        audio_capture_stop();
        ESP_LOGI(TAG, "Wake word mode stopped");

        // Small delay to ensure capture task fully exits
        vTaskDelay(pdMS_TO_TICKS(100));

        // Play beep tone as audio feedback (800Hz, 120ms, 40% volume)
        ESP_LOGI(TAG, "🔊 Playing wake word confirmation beep...");
        extern esp_err_t beep_tone_play(uint16_t frequency, uint16_t duration, uint8_t volume);
        esp_err_t beep_ret = beep_tone_play(800, 120, 40);
        if (beep_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to play beep tone: %s", esp_err_to_name(beep_ret));
        }

        // Small delay after beep before starting recording
        vTaskDelay(pdMS_TO_TICKS(50));

        ESP_LOGI(TAG, "Starting voice pipeline...");

        // Start voice assistant pipeline
        test_audio_streaming();
    }
}

// Wrapper function to feed audio to wake word detector
static void wwd_audio_feed_wrapper(const int16_t *audio_data, size_t samples)
{
    wwd_feed_audio(audio_data, samples);
}

static void tts_playback_complete_handler(void)
{
    ESP_LOGI(TAG, "🔄 TTS playback complete - resuming wake word detection...");

    // Resume music if it was paused for TTS
    if (music_paused_for_tts && local_music_player_is_initialized()) {
        ESP_LOGI(TAG, "Resuming music playback after TTS");
        local_music_player_resume();
        music_paused_for_tts = false;
    }

    // Resume wake word detection
    wwd_start();
    audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);

    ESP_LOGI(TAG, "✅ Wake word detection resumed - ready for next command");
}

static void vad_event_handler(audio_capture_vad_event_t event)
{
    switch (event) {
        case VAD_EVENT_SPEECH_START:
            ESP_LOGI(TAG, "🎤 Speech detected - recording...");
            break;

        case VAD_EVENT_SPEECH_END:
            ESP_LOGI(TAG, "🔇 Silence detected - VAD auto-stop triggered");
            ESP_LOGI(TAG, "Total audio chunks sent: %d", audio_chunks_sent);

            // Mark pipeline as inactive to stop sending audio chunks
            pipeline_active = false;

            // Stop audio capture immediately to free I2S for TTS playback
            audio_capture_stop();
            ESP_LOGI(TAG, "Audio capture stopped - I2S freed for TTS");

            // End audio stream to HA
            ha_client_end_audio_stream();

            // Cleanup pipeline handler
            if (pipeline_handler != NULL) {
                free(pipeline_handler);
                pipeline_handler = NULL;
            }
            audio_chunks_sent = 0;

            // WWD will be resumed AFTER TTS playback completes (via callback)
            ESP_LOGI(TAG, "Waiting for TTS playback to complete before resuming WWD...");
            break;
    }
}

static void audio_capture_handler(const uint8_t *audio_data, size_t length)
{
    // Check if pipeline is still active
    if (!pipeline_active || pipeline_handler == NULL) {
        return;  // Pipeline closed or not started
    }

    // Validate audio data
    if (audio_data == NULL || length == 0) {
        return;
    }

    // Skip warmup chunks to avoid wake word remnants
    if (warmup_chunks_skip > 0) {
        warmup_chunks_skip--;
        ESP_LOGD(TAG, "Skipping warmup chunk (%d remaining)", warmup_chunks_skip);
        return;
    }

    // Stream audio to HA
    esp_err_t ret = ha_client_stream_audio(audio_data, length, pipeline_handler);
    if (ret == ESP_OK) {
        audio_chunks_sent++;
    } else {
        ESP_LOGW(TAG, "Failed to stream audio chunk - pipeline may be closed");
    }
}

static void test_audio_streaming(void)
{
    ESP_LOGI(TAG, "========================================");
    ESP_LOGI(TAG, "Starting Audio Streaming Test with VAD");
    ESP_LOGI(TAG, "========================================");

    // Configure VAD with dynamic settings (adjustable via MQTT)
    vad_config_t vad_config = {
        .sample_rate = 16000,
        .speech_threshold = vad_threshold,
        .silence_duration_ms = vad_silence_duration,
        .min_speech_duration_ms = vad_min_speech,
        .max_recording_ms = vad_max_recording
    };

    ESP_LOGI(TAG, "📊 VAD Config: threshold=%lu, silence=%lums, min_speech=%lums, max=%lums",
             vad_config.speech_threshold,
             vad_config.silence_duration_ms,
             vad_config.min_speech_duration_ms,
             vad_config.max_recording_ms);

    // Enable VAD with event callback
    esp_err_t ret = audio_capture_enable_vad(&vad_config, vad_event_handler);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable VAD");
        return;
    }

